# Pandas
import pandas as pd

etf202212 = pd.read_excel(r'C:\work\ETF매매현황_221229.xlsx',
                          names =["시장구분",	"펀드명",	"기초지수명",	"운용회사", "순자산총액(억원)",	"총발행좌수(천좌)", 
                                  "최초상장가격",	"거래가격_전일종가", "거래가격_당일종가", "추적오차_NAV(a)","추적오차_기초지수(b)", "추적오차_오차(a-b)","거래대금(백만원)", "거래량", "지수산출기관", 
                                  "상장일", "기초시장_대분류", "기초시장_중분류", "기초시장_소분류", "기초자산_대분류", "기초자산_중분류", "기초자산_소분류" "과세유형" ],
                          skiprows=9
                          )

etf202212.reset_index(drop=False, inplace=True)
print(etf202212)